# 先理解:
# Python容器类型的一种,可以用来同时存储多个元素
# 可以是不同的类型的,可以是相同类型的,一般是:相同类型

# 列表格式如下:
# lists = []
# lists = list()
# lists = [值1.值2...] -> ['张飞','关羽','貂蝉']

# 元素特点:
# 1.可以存储重复元素;
# 2.元素有序;
# 3.元素值可以修改,且每个元素都有索引,索引从0开始;

# 取值和长度
# 1.lists[下标]:
# ①获取列表的某一项
# ②下标超出,会报错,索引越界


# 2.列表切片:
# lists[起始:结束:步长]

l = ['盖伦', '德邦', '皇子', '德莱文']
print(l)
print(l[0])
print(l[-1])
print(l[-2])  # 负数 -1 开始从右往左的 索引位置
print(l[len(l) - 1])  # 最后一位
# l1 = list(['盖伦', '德邦'])
# print(l1)

# 应用题
# ① 获取德邦,皇子
# 运用好字符串切片 即 数组也可以切片
print(l[1:3])

#   获取'皇子', '德莱文'
print(l[-2::])

#   获取'德莱文','皇子'
print(l[-1:-3:-1])

# print(l[len(l)])  # 报错 因为超出最大索引

# ② 准备一个列表,存储 冰箱,洗衣机,空调,并利用下标,把空调取出来
dq = ["冰箱", "洗衣机", "空调"]
print(dq[2])
print(dq[-1:])
print(dq[2:])

# ③准备一个列表,存储 1,2,3,4,5,6 并利用数组切片,截取数组最后三项
num = [1, 2, 3, 4, 5, 6]
print(num[-3:])
