# Todo:字典 { 键值对 } , 键 不能修改 值 能修改,等于 = 某一个值的话可能修改  也可能新增

# Todo: 列表    vs    元组    vs    字典
#      可以改变      不可改变       可以改变
#      操作数据        查询       [key] = 值 新增修改
#                都可以 for in 遍历
#                都是 len() 查看长度
#                in /  not in 判断 键是否存在


# Todo: 空集合:set(),有值集合 {1,2,3,3,4},字典{"name":"超人"},{} 空字典,
#       用集合 set() set自带去重能力
#       print(type({1, 2, 3}))  # set 类型
#       print(type({1,1,2,}))  # set 类型
#       print(type({}))  # dict 类型


# Todo:推导式(解析式) -> 一行代码实现 for循环 / if判断

# Todo:函数入门 -> 定义一次,多次调用
#   def 函数名( 可选参数1,xxx ):
#       函数体 -> 逻辑代码
#       return 结果
#  函数内部的 return 将结果返回给调用处
#  res =  函数名() -> 指向输出结果


